Privacy Policy

Welcome to use our product. When you use our products, we may collect and use your information. We are committed to vigorously protecting the privacy of users (hereinafter referred to as "users" or "you") of YUEN SANG Trading Company products and services. We will update this privacy policy from time to time, so the relevant measures will change accordingly. We sincerely request that you regularly check this page to ensure that you are always aware of our privacy policy. If you have any questions about this privacy policy and related matters, please contact customer service mattewmaxiu@outlook.com This privacy policy mainly explains the following information to you:

What information do we collect;

Our purpose of collecting information;

The rights you enjoy.

This privacy policy applies to all products and services of YUEN SANG Trading Company. When you use any of our products and services, you agree to the content described in this policy.

1、 The information we collect

1. Non identity information

When you use YUEN SANG Trading Company's products and services, we may collect information about where users come from, the order of access, and so on. For example, recording the source and browser information of each user.

2. Registration information

When you use our registration service, we may collect your personal information, such as: personal identification (including ID card, passport, driver's license, etc.), place of origin, gender, personal mobile phone number, network identification (including account, IP address, email address and password, password protection information related to the above, etc.).

3. Use product equipment information

When you use YUEN SANG Trading Company's products, we may collect your device information (including device model, device MAC address, operating system type, device settings, etc.), unique device identification codes in software lists (such as IMEI/Android ID/IDA/OPENUDID/UUID, SIM card IMSI information, etc., which describe the basic information of personal commonly used devices).

4. Product Information

When you use YUEN SANG Trading Company products, we may collect and consolidate your game virtual currency, game balance, game type, game records, etc.

2、 How do we collect and use information

1. The information you provided

A. The information you provide to us when registering or using joint product services;

B. The shared information you provide to other parties through joint products, as well as the information you store when using joint products;

C. Your information shared by other parties;

D. We have obtained information about your use of YUEN SANG Trading Company products or services. Such as log information, device information, network information, etc.

2. Cookies and logs

We may obtain and use your information through cookies and store it as log information.

We provide our users with a better web experience by using cookies. We use cookies to bring benefits to users, for example, the login process is faster when using YUEN SANG Trading Company products and services. Cookies can help us determine which pages and content you are connecting to, enabling us to serve you better and faster, and enriching the services you enjoy in YUEN SANG Trading Company. You can control whether your device accepts cookies. Please refer to the documentation provided with your device for more information.

3. We use cookies for the following purposes

A. Remember who you are. Cookies help us identify you as one of our registered users, or save the preferences or other information you provide us about you;

B. Analyze your usage of our services. We can use cookies to understand what activities or services you enjoy when using YUEN SANG Trading Company products.

We use cookies to collect non personally identifiable information for the above purposes, which may be provided to other partners to analyze how you and other users use the YUEN SANG TRADING COMPANY service.

We may place cookies on our products or services, which may collect non personally identifiable information from you to analyze how users use our products and services. You can control cookies through user selection mechanisms or user management. If you stop using cookies, we may not be able to provide you with the best service, and some services may also be unavailable.

3、 We collect and use your information for the following purposes:

1. Help you quickly complete registration

To facilitate our service to you, you need to provide basic registration information such as personal identification, mobile phone number, and create your username and password. 2. Provide you with prizes and services

A. In some service projects, in order for us to provide you with prizes or services, you need to provide personal identification information, name, shipping address, postal code, recipient, contact phone number, and other information. If you refuse to provide such information, we will not be able to complete the provision of prizes or services;

B. When you contact us, we may keep your communication/call records and your contact information so that we can contact you or help you solve problems;

C. In order to provide you with prizes or services, we may collect logistics information, prize information, and other information that you have selected, and may share it with the aforementioned service providers.

3. Notify you

We may notify you of our services when necessary (such as suspension, maintenance, etc.) so that you can better understand the status of our services.

4. Improve our services

We may use the information collected through a YUEN SANG TRADING CO. product for our other products. We may invite you to participate in a survey about YUEN SANG Trading Company products to help us improve existing products and services or design new ones.

5. Provide you with security guarantees

To ensure the authenticity of your identity and provide you with better security protection, you can provide us with personal sensitive information such as identity proof to complete real name authentication.

In addition to authentication, we may use your information for customer service, security, fraud detection, archiving, and backup purposes to ensure the security of the services we provide to you; We may use or integrate the information we collect about you, as well as the information obtained by our partners from you or lawfully shared, for the purpose of comprehensively assessing your account, conducting identity verification, detecting and preventing security incidents, and taking necessary measures such as recording, auditing, analyzing, and disposing in accordance with the law.

4、 Sharing and Disclosure

1. Sharing

Without your explicit consent, we will not share your information with any third party other than YUEN SANG Trading Company

A. To provide you with services, we may share your information with our partners or third parties, such as logistics services;

B. To achieve the purposes described in Section

2 "How We Collect and Use Information" of this Privacy Policy;

C. Maintain and improve our services. We may share your information with our partners and other third parties to help us provide you with more targeted and comprehensive services, such as communication service providers who send emails or push notifications on our behalf;

D. Fulfill our obligations and exercise our rights under this privacy policy or other agreements we have reached with you;

E. Sharing with third parties such as partners who entrust us with promotion, but we will only provide information about the coverage and effectiveness of promotional activities to these clients, and will not provide identifiable information such as your name, phone number, or email address; Alternatively, we may consolidate this information so that it cannot identify your personal identity;

F. Within the scope permitted by laws and regulations, we may exchange information with other companies or organizations in order to comply with the law and safeguard the interests, property, or safety of ourselves and our affiliated or cooperative companies, you or other YUEN SANG Trading Company users, or the general public, such as to prevent illegal activities such as fraud, reduce credit risk;

G. Assist in resolving disputes or controversies between you and others in accordance with your legal requirements;

H. Provide your information according to the legal request of your guardian;

I. Provided in accordance with the individual service agreement signed with you (including electronic agreements signed online and corresponding platform rules) or other legal documents;

J. Provided based on academic research;

K. Based on the social public interest stipulated by laws and regulations.

We will only share your information for legitimate, necessary, specific, and clear purposes. We have strict confidentiality agreements with companies, organizations, and individuals with whom we share information, requiring them to handle information in accordance with our instructions, this privacy policy, and any other relevant confidentiality and security measures.

2. Disclosure

We will only disclose your information in the following situations:

A. Under the premise of complying with industry standards for security protection measures;

B. After obtaining your explicit consent, disclose the information you specify as per your request;

C. If laws, regulations, mandatory administrative enforcement or judicial requirements require us to provide your information, we may disclose your information according to the type and manner of disclosure. Subject to compliance with laws and regulations, when we receive such disclosure requests, we will require the recipient to provide corresponding legal documents, such as subpoenas or investigation letters.

5、 Our protection and processing of your information

1. Data security technical measures

A. We will take security measures that comply with industry standards, including establishing reasonable regulations and security technologies to prevent unauthorized access, use, and modification of your information, and to avoid data damage or loss;

B. Network services use various encryption technologies, such as SSL, TLS, etc., to protect your information;

C. Isolate through isolation techniques;

D. In the process of using information, such as information display, information correlation calculation, etc., we will adopt various data anonymization techniques to enhance the security of information in use. Adopting strict data access control and multiple identity authentication technology to protect information and prevent illegal use of data.

2. Other security measures taken to protect information

A. By establishing a data classification and grading system, data security management standards, and data security development standards, information is stored and managed in a standardized manner;

B. Comprehensive security control of data is implemented through information contact confidentiality agreements, monitoring and auditing mechanisms;

C. Enhance security awareness. We will also conduct security and privacy protection training courses to enhance employees' awareness of the importance of information protection.

3. Only necessary personnel are allowed to know the information and ensure that those who know it are not recorded or retained.

Strict access control and monitoring mechanisms have been established for this purpose. We also require all personnel who may have access to your information to fulfill their respective confidentiality obligations. Failure to fulfill the above obligations will result in legal action.

We will take all reasonable and feasible measures to ensure that irrelevant information is not collected.

4. We will do our best to ensure or guarantee the security of any information you send to us.

If our physical, technological, or management protective facilities are damaged, resulting in unauthorized access, public disclosure, tampering, or destruction of information, causing damage to your legitimate rights and interests, we will bear corresponding legal responsibilities.

5. How to handle security incidents

A. When communicating or providing services through YUEN SANG Trading Company, you may inevitably disclose your own information to other parties, such as mobile phone numbers, email addresses, etc. Please protect your own information properly and only provide it to others when necessary;

B. To cope with the potential risks of information leakage, damage, and loss, we have established multiple systems, clarified the grading standards and corresponding processing procedures for security incidents and vulnerabilities, and set up a dedicated security incident emergency team. In accordance with the requirements of security incident handling standards, we have activated security plans for different security incidents, conducted stop loss, analysis, positioning, developed remedial measures, and jointly cracked down with relevant departments.

C. If a security incident unfortunately occurs, we will promptly inform you in accordance with the requirements of laws and regulations: the basic situation of the incident, the solutions we have taken or will take, and possible situations that may arise, your suggestions for preventing and reducing risks, and the solutions you can remedy. At the same time, we will report the information security incident and disposal situation in accordance with the requirements of regulatory authorities;

D. Due to limitations in technology and risk prevention, despite our efforts to strengthen security measures, we cannot guarantee 100% information security. Therefore, you need to be aware of situations and issues that may occur outside of our control

6、 How do you manage your information

1. Access, update, and delete

We encourage you to update and modify your information to make it more accurate and effective. You can access your information through Beidou Navigation Satellite System and request us to make complete or reasonable modifications, supplements, and deletions according to the corresponding information management requirements. We will take appropriate technical measures to ensure that you can access, update, and correct your own information or other information provided by the Beidou Navigation Satellite Service whenever possible. When accessing, updating, correcting, and deleting the aforementioned information, we may require you to verify your identity to ensure the security of the information.

2. Openness and Sharing

In the process of using our services, you will share relevant information about your use of the services (such as gender, nickname, etc.), which can be modified after you access it yourself. We are not responsible for the leakage of your information.

3. Exit

Your account or related information may be cancelled or deleted in accordance with the service agreement of BeiDou Xingtong and relevant national laws and regulations. After the cancellation or deletion of your account or related information, it will be handled in accordance with the YUEN SANG Trading Company service agreement.

4. Change the scope of your authorized consent

You can choose whether to disclose your information, or change the scope of your authorization for us to continue collecting information or revoke your authorization by deleting information, disabling device functions, and other means.

5. Sensitive information

Certain information may be considered sensitive due to its specificity, such as your race, religion, personal health and medical information, as well as identification documents, personal biometric information, property information, whereabouts, minors' information, etc. Therefore, you need to carefully consider before using the products or services we provide you. You agree that such sensitive personal information will be processed in accordance with the relevant terms of the privacy policy.

You need to carefully consider the content and information you provide in the service.

7、 Third party services

We choose reputable third parties as our partners to provide information and services to users, but the privacy policies of each partner are different from those of LinkedIn. When you enter the third-party service, LinkedIn's privacy policy will no longer be valid. We suggest that you review third-party privacy policies to ensure the security of your information.

Restrictions on minors

Any underage participant participating online
